; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_11)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - person
	)

  (:init
		(= (x b0) -1)
(= (y b0) 0)
(= (x b1) 0)
(= (y b1) 0)
(= (x b2) 3)
(= (y b2) 0)
(= (x b3) -1)
(= (y b3) 0)
(= (x b4) -2)
(= (y b4) 0)
(= (x b5) 3)
(= (y b5) 0)
(= (x b6) 3)
(= (y b6) 0)
(= (x b7) -5)
(= (y b7) 0)
(= (x b8) 5)
(= (y b8) 0)
(= (x b9) 4)
(= (y b9) 0)
(= (x b10) -3)
(= (y b10) 0)

		(= (d p0) 41)
(= (d p1) 66)
(= (d p2) 36)
(= (d p3) 14)
(= (d p4) 50)
(= (d p5) 26)
(= (d p6) 2)
(= (d p7) 37)
(= (d p8) 61)
(= (d p9) 29)
(= (d p10) 72)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
		)
	)
)

; plan
1. (go_north_east b1)
   changed: (x b1) from 0 to 1.5, (y b1) from 0 to 1.5
   goals met: 0 of 11
2. (go_north_east b1)
   changed: (x b1) from 1.5 to 3, (y b1) from 1.5 to 3
   goals met: 0 of 11
3. (go_north_east b1)
   changed: (x b1) from 3 to 4.5, (y b1) from 3 to 4.5
   goals met: 0 of 11
4. (go_north_east b1)
   changed: (x b1) from 4.5 to 6, (y b1) from 4.5 to 6
   goals met: 0 of 11
5. (go_north_east b1)
   changed: (x b1) from 6 to 7.5, (y b1) from 6 to 7.5
   goals met: 0 of 11
6. (go_north_east b1)
   changed: (x b1) from 7.5 to 9, (y b1) from 7.5 to 9
   goals met: 0 of 11
7. (go_north_east b1)
   changed: (x b1) from 9 to 10.5, (y b1) from 9 to 10.5
   goals met: 0 of 11
8. (go_north_east b1)
   changed: (x b1) from 10.5 to 12, (y b1) from 10.5 to 12
   goals met: 0 of 11
9. (go_north_east b1)
   changed: (x b1) from 12 to 13.5, (y b1) from 12 to 13.5
   goals met: 0 of 11
10. (go_north_west b1)
   changed: (x b1) from 13.5 to 12, (y b1) from 13.5 to 15
   goals met: 0 of 11
11. (save_person b1 p6)
   added: (saved p6)
   goals met: 1 of 11
12. (go_north_west b1)
   changed: (x b1) from 12 to 10.5, (y b1) from 15 to 16.5
   goals met: 1 of 11
13. (go_north_west b1)
   changed: (x b1) from 10.5 to 9, (y b1) from 16.5 to 18
   goals met: 1 of 11
14. (go_north_west b1)
   changed: (x b1) from 9 to 7.5, (y b1) from 18 to 19.5
   goals met: 1 of 11
15. (go_north_west b1)
   changed: (x b1) from 7.5 to 6, (y b1) from 19.5 to 21
   goals met: 1 of 11
16. (save_person b1 p3)
   added: (saved p3)
   goals met: 2 of 11
17. (go_north_west b1)
   changed: (x b1) from 6 to 4.5, (y b1) from 21 to 22.5
   goals met: 2 of 11
18. (go_north_west b1)
   changed: (x b1) from 4.5 to 3, (y b1) from 22.5 to 24
   goals met: 2 of 11
19. (go_north_west b1)
   changed: (x b1) from 3 to 1.5, (y b1) from 24 to 25.5
   goals met: 2 of 11
20. (go_north_west b1)
   changed: (x b1) from 1.5 to 0, (y b1) from 25.5 to 27
   goals met: 2 of 11
21. (save_person b1 p5)
   added: (saved p5)
   goals met: 3 of 11
22. (go_north_west b1)
   changed: (x b1) from 0 to -1.5, (y b1) from 27 to 28.5
   goals met: 3 of 11
23. (go_north_west b1)
   changed: (x b1) from -1.5 to -3, (y b1) from 28.5 to 30
   goals met: 3 of 11
24. (go_north_west b1)
   changed: (x b1) from -3 to -4.5, (y b1) from 30 to 31.5
   goals met: 3 of 11
25. (go_north_west b1)
   changed: (x b1) from -4.5 to -6, (y b1) from 31.5 to 33
   goals met: 3 of 11
26. (go_north_west b1)
   changed: (x b1) from -6 to -7.5, (y b1) from 33 to 34.5
   goals met: 3 of 11
27. (go_north_west b1)
   changed: (x b1) from -7.5 to -9, (y b1) from 34.5 to 36
   goals met: 3 of 11
28. (go_north_west b1)
   changed: (x b1) from -9 to -10.5, (y b1) from 36 to 37.5
   goals met: 3 of 11
29. (go_north_west b1)
   changed: (x b1) from -10.5 to -12, (y b1) from 37.5 to 39
   goals met: 3 of 11
30. (go_north_east b1)
   changed: (x b1) from -12 to -10.5, (y b1) from 39 to 40.5
   goals met: 3 of 11
31. (go_north_east b1)
   changed: (x b1) from -10.5 to -9, (y b1) from 40.5 to 42
   goals met: 3 of 11
32. (go_north_east b1)
   changed: (x b1) from -9 to -7.5, (y b1) from 42 to 43.5
   goals met: 3 of 11
33. (save_person b1 p9)
   added: (saved p9)
   goals met: 4 of 11
34. (save_person b1 p2)
   added: (saved p2)
   goals met: 5 of 11
35. (go_north_east b1)
   changed: (x b1) from -7.5 to -6, (y b1) from 43.5 to 45
   goals met: 5 of 11
36. (save_person b1 p7)
   added: (saved p7)
   goals met: 6 of 11
37. (go_north_east b1)
   changed: (x b1) from -6 to -4.5, (y b1) from 45 to 46.5
   goals met: 6 of 11
38. (go_north_east b1)
   changed: (x b1) from -4.5 to -3, (y b1) from 46.5 to 48
   goals met: 6 of 11
39. (go_north_east b1)
   changed: (x b1) from -3 to -1.5, (y b1) from 48 to 49.5
   goals met: 6 of 11
40. (go_north_east b1)
   changed: (x b1) from -1.5 to 0, (y b1) from 49.5 to 51
   goals met: 6 of 11
41. (go_north_east b1)
   changed: (x b1) from 0 to 1.5, (y b1) from 51 to 52.5
   goals met: 6 of 11
42. (go_north_east b1)
   changed: (x b1) from 1.5 to 3, (y b1) from 52.5 to 54
   goals met: 6 of 11
43. (go_north_east b1)
   changed: (x b1) from 3 to 4.5, (y b1) from 54 to 55.5
   goals met: 6 of 11
44. (go_north_east b1)
   changed: (x b1) from 4.5 to 6, (y b1) from 55.5 to 57
   goals met: 6 of 11
45. (save_person b1 p4)
   added: (saved p4)
   goals met: 7 of 11
46. (save_person b1 p0)
   added: (saved p0)
   goals met: 8 of 11
47. (go_north_west b1)
   changed: (x b1) from 6 to 4.5, (y b1) from 57 to 58.5
   goals met: 8 of 11
48. (go_north_west b1)
   changed: (x b1) from 4.5 to 3, (y b1) from 58.5 to 60
   goals met: 8 of 11
49. (go_north_west b1)
   changed: (x b1) from 3 to 1.5, (y b1) from 60 to 61.5
   goals met: 8 of 11
50. (go_north_west b1)
   changed: (x b1) from 1.5 to 0, (y b1) from 61.5 to 63
   goals met: 8 of 11
51. (save_person b1 p8)
   added: (saved p8)
   goals met: 9 of 11
52. (go_north_east b1)
   changed: (x b1) from 0 to 1.5, (y b1) from 63 to 64.5
   goals met: 9 of 11
53. (go_north_east b1)
   changed: (x b1) from 1.5 to 3, (y b1) from 64.5 to 66
   goals met: 9 of 11
54. (go_north_east b1)
   changed: (x b1) from 3 to 4.5, (y b1) from 66 to 67.5
   goals met: 9 of 11
55. (go_north_west b1)
   changed: (x b1) from 4.5 to 3, (y b1) from 67.5 to 69
   goals met: 9 of 11
56. (save_person b1 p1)
   added: (saved p1)
   goals met: 10 of 11
57. (go_north_west b1)
   changed: (x b1) from 3 to 1.5, (y b1) from 69 to 70.5
   goals met: 10 of 11
58. (go_north_west b1)
   changed: (x b1) from 1.5 to 0, (y b1) from 70.5 to 72
   goals met: 10 of 11
59. (save_person b1 p10)
   added: (saved p10)
   goals met: 11 of 11
